[
    {
        "course": "CPSC110",
        "timestamp": "Sep 25th, 2024",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "MY GOAT 😍😍🐐🐐❗❗"
    },
    {
        "course": "CPSC110",
        "timestamp": "Sep 22nd, 2024",
        "quality": "4.0",
        "difficulty": "4.0",
        "comments": "Gregor's class is tough but rewarding. Go to lectures, do the homework, and use resources like unstuck study AI to succeed. He may seem strict, but cares about students' learning."
    },
    {
        "course": "CPSC110",
        "timestamp": "Jul 10th, 2024",
        "quality": "4.0",
        "difficulty": "5.0",
        "comments": "Gregor is a warm-hearted prof. I remember one time he attended my lab and he show everyone some advice how to work on lab problems. He told me something related to the beauty of coding (?) I could not remember. Although I'm a non-cs major, I really think I picked up something from him. But Gregor talks really slow so sometimes it is pretty annoying"
    },
    {
        "course": "CPSC110",
        "timestamp": "Jun 25th, 2024",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Gregor is a strict but caring professor. He may seem harsh sometimes but he genuinely wants you to succeed. I had no programming experience prior to this course, but if you listen to him you will most likely succeed. DO NOT fall behind because the concepts are connected. The exams are fair and relevant to the material covered. Course taken: 2023W1"
    },
    {
        "course": "CPSC110",
        "timestamp": "May 5th, 2024",
        "quality": "1.0",
        "difficulty": "5.0",
        "comments": "People say Gregor is great because they're cs majors, and who in cs don't know coding beforehand? 110 is NOT beginner-friendly. Taking his course felt like learning how to speak a language fluently in 3 months. Students can't help each other on psets, and the learning environment  is just depressing and unhealthy. Pls avoid if it's not a major req."
    },
    {
        "course": "CPSC110",
        "timestamp": "Apr 24th, 2024",
        "quality": "4.0",
        "difficulty": "3.0",
        "comments": "He's rather strict and a little bit difficult, but overall a pretty good prof. As long as you study you should be fine. Not very approachable, but a good prof overall."
    },
    {
        "course": "CPSC110",
        "timestamp": "Mar 25th, 2024",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "He is super caring and very intelligent.\n\nAdvice for his class:\n- Focus, his content can be hard, but very enjoyable\n- Do the homework, go to lectures, and practice problem sets over and over.\n- This course is easy if you put in about 16 hours a week and you will have a great time!\n-Trust the natural recursion."
    },
    {
        "course": "CPSC110",
        "timestamp": "Mar 9th, 2024",
        "quality": "2.0",
        "difficulty": "5.0",
        "comments": "The prof spends a lot of time \"complaining\" about how there are sooo many students to manage, and how its soo hard. Yet the course slides and course itself is riddled with mistakes, typos, and errors (so many errors everywhere). Also, this is not an intro course. It's way too fast-paced and heavy, especially if you have no previous experience (me)"
    },
    {
        "course": "CPSC110",
        "timestamp": "Feb 26th, 2024",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "He has done this for a long time, and it really shows."
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 31st, 2024",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Amazing prof! CPSC 110 is a very fun course and completely doable. Just make sure to keep up with the edX content, pay attention to all lectures, finish all problem sets on time, and grind the past midterms / finals. Oh, and make sure to come to a lot of office hours."
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 20th, 2024",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Gregor came off as intimidating at first, but you soon realize that's just his humour. He's extremely helpful during office hours, walking around to check in on every student and how they're doing. If you don't fully understand the content, make sure to stay on top of all the work."
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 12th, 2024",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "Gregor has so much personality. I did find him condescending at first (I never asked questions in lecture), but I grew to appreciate his sense of humour over time. This course requires lots of time and effort, but solving the problems is so incredibly rewarding. I also felt that he truly cared about his students and wanted us to succeed."
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 11th, 2024",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "The course isn't too difficult as long as you don't fall too behind. Rewatching lecture recordings helps a lot with understanding the content."
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 10th, 2024",
        "quality": "4.0",
        "difficulty": "4.0",
        "comments": "Great lectures, however you must pay immense attention to be able to do good. A lot of practice required. The course load is very heavy, even unfair at times - but is very rewarding and has a lot of learning outcome. Gregor was very supportive and answered most questions as best as possible in a 600 student class."
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 7th, 2024",
        "quality": "2.0",
        "difficulty": "3.0",
        "comments": "Hated to answer student questions unless they were \"good enough\" and was completely unhelpful when students faced online issues (there were a ton of technical issues). Overly anal about the details and lectures were monotone, slow, and boring. You're better off watching lecture recordings at 2x speed than attending class. Definitely overrated"
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 7th, 2024",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "Gregor was a fun prof. Attending lectures is essential and make sure you actually listen when he says to try the problems in the videos on your own instead of just following along. He was a fair teacher and funny. Only problem is the course is hard but if you genuinely do all the problems and not just follow along in the video you will be fine"
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 6th, 2024",
        "quality": "5.0",
        "difficulty": "1.0",
        "comments": "he is good professor, and made our first year fantastic"
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 5th, 2024",
        "quality": "3.0",
        "difficulty": "4.0",
        "comments": "well, i would say greogr himself is a very conscientious prof who wants you to be successful in the class, nonetheless the course itself is very very poorly designed in my opinion"
    },
    {
        "course": "CPSC110",
        "timestamp": "Jan 4th, 2024",
        "quality": "4.0",
        "difficulty": "3.0",
        "comments": "DO NOT think you can get away from this course without putting in the amount of work the Prof said clearly at the beginning of the class. Your whole pyramid scheme of knowledge will fall apart just by missing one part of the course. Also, do what the course tells you to, don't act smart"
    },
    {
        "course": "CPSC110",
        "timestamp": "Dec 30th, 2023",
        "quality": "2.0",
        "difficulty": "5.0",
        "comments": "Gregor is a nice guy, no doubt of that. From my experience and my friend's, he's kind and helpful when you see him during office hours. However, during our online lectures, he seems to be the opposite, and that's, unfortunately, where we learn from him most of the time. Furthermore, I'm not a fan of the way he teaches, as I leave lectures confused."
    }
]