[
    {
        "course": "CPSC221",
        "timestamp": "Aug 5th, 2024",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "Not sure why CPEN has to take this since our 221 overlaps this significantly. Excellent prof, lectures, course organization though. Very nice prof and generous marking scheme. Assessments very fair and responsive on Piazza."
    },
    {
        "course": "CPSC221",
        "timestamp": "Jun 22nd, 2023",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Explains concepts super well and made this course a lot easier to understand. Makes lecture recordings so you can watch on 2x speed if you miss any. Tests are very fair."
    },
    {
        "course": "CPSC203",
        "timestamp": "May 20th, 2023",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Cinda wasn't super available for OH or individual help but she's a great lecturer. I had so much fun in her classes and can tell she's super passionate about her projects. Such an inspirational person and very fun to listen to!"
    },
    {
        "course": "CPSC221",
        "timestamp": "Apr 25th, 2023",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "Cinda is one of my favorite profs. Her lectures were super engaging and informative. She is super caring and helpful to all the students. The course itself is more self taught with assignments and quizzes which make up a massive chunk of the grade but isn't hard if you just put enough time for them. Overall great prof and wish she taught more."
    },
    {
        "course": "CPSC221",
        "timestamp": "Mar 6th, 2023",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "If every computer science class at UBC was taught by Cinda, I wouldn't be trying to transfer away.\n\nMy favourite prof by far."
    },
    {
        "course": "CPSC221",
        "timestamp": "Jan 16th, 2023",
        "quality": "4.0",
        "difficulty": "3.0",
        "comments": "Pretty nice prof, super caring but sometimes not as organized. There are frequently errors in lecture content, but she (or the TA team) is quick to correct them."
    },
    {
        "course": "CPSC221",
        "timestamp": "Jan 7th, 2023",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "super inspirational!! Genuinely cares about students, clear grading criteria, a lof of help available. Overall a great experience and a great course"
    },
    {
        "course": "CPSC221",
        "timestamp": "Dec 28th, 2022",
        "quality": "1.0",
        "difficulty": "2.0",
        "comments": "This professor left much to be desired. She tends to treat students like children. Communicates unprofessionally (like a teen texting a friend, not a professor at a major university). Makes mistakes frequently.  Only positive I can really say is that she's not mean (but that's a low bar)."
    },
    {
        "course": "CS221",
        "timestamp": "Dec 17th, 2022",
        "quality": "1.0",
        "difficulty": "1.0",
        "comments": "This course was too easy. Please make it harder. Can't believe the CPSC department is literally giving out free A+ grades smh.\n\nPlease make the course harder. Reduce the weights for examlets, labs, etc. Make the final 80%."
    },
    {
        "course": "CPSC221",
        "timestamp": "Dec 17th, 2022",
        "quality": "4.0",
        "difficulty": "3.0",
        "comments": "Class was pretty chill, super nice mark breakdowns with the weekly 5% tests rather than midterms, really helped me to keep up with the course. Cindeez was super nice and explained things fairly clearly although her slides are a bit messy and hard to understand if you look at them out of context. William was an L."
    },
    {
        "course": "CPSC221",
        "timestamp": "Dec 17th, 2022",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "Cinda was super sweet and brought a lot of energy to lectures. Her teaching is clear and engaging, though it's sometimes hard to read what she's writing. The course is very generous with how assignments are weighted. 9 weekly examlets worth 5% each, 3 homework and 3 programming assignments each worth 4%, with a final worth 23%, and 8% on labs."
    },
    {
        "course": "CPSC221",
        "timestamp": "Dec 16th, 2022",
        "quality": "1.0",
        "difficulty": "1.0",
        "comments": "Her course is for children! topics are super easy but she makes a lot of mistakes and that causes confusion. Cinda: if you think that's true clap. :| \nCinda: I'll draw a heart wherever it's a graph and I'll draw a star wherever it's a queue. :| \nCinda: Remember 2 weeks ago I made a mistake? sorry if you messed up your exam because of that. :|"
    },
    {
        "course": "CPSC221",
        "timestamp": "Dec 12th, 2022",
        "quality": "5.0",
        "difficulty": "1.0",
        "comments": "Professor Heeren *is* the best professor I have had at university so far. I did not know college courses could be this well designed. Her excitement for the subject shows. Each lecture is a pleasure to attend. Her energy, pacing, engagement with the class, care for the students' well-being- it's incredibly inspiring. She's genuinely a role model."
    },
    {
        "course": "CPSC221",
        "timestamp": "Oct 26th, 2022",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "Cinda is great! I would recommend her to anyone and everyone, she is caring, easy to talk to, helpful, and clear."
    },
    {
        "course": "CPSC121",
        "timestamp": "Sep 2nd, 2022",
        "quality": "4.0",
        "difficulty": "1.0",
        "comments": "I LOVE Cinda. She's a gem. So so so kind and understanding. She also radiates a very smart energy, like she knows what she's talking about in a very non-arrogant way (obv but I find it inspirational and it comes out in her teaching as she gets us to see different ways). I took CPSC 203 with her (but course option is not letting me select that)"
    },
    {
        "course": "CPSC221",
        "timestamp": "Jun 18th, 2022",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "Cinda is amazing. Super approachable, helpful and encouraging during office hours, and her lectures are engaging."
    },
    {
        "course": "CPSC221",
        "timestamp": "Jun 16th, 2022",
        "quality": "5.0",
        "difficulty": "1.0",
        "comments": "A fantastic professor. Her lectures are super interesting and I'm always so excited to show up and watch. Time flies when you're in her class because she schedules her lectures not as an information foie gras, but rather as a journey and you're discovering the algorithms and data structures with her as if buddies on a voyage. Tests are super fair."
    },
    {
        "course": "CPSC221",
        "timestamp": "Jan 9th, 2022",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Cinda is absolutely amazing. Lectures were interesting and easy to understand and she's also very active on piazza and discord. Btw she's a big fan of Taylor Swift haha."
    },
    {
        "course": "CPSC221",
        "timestamp": "Jan 4th, 2022",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "She's an amazing prof. You can easily do well as long as you keep up with the material and practice problems."
    },
    {
        "course": "CPSC221",
        "timestamp": "Dec 21st, 2021",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Wonderful professor and just a very useful class in general. There were so many practice questions which made learning the material so fun and straightforward. So far my favourite CPSC course at UBC along with 210. I would strongly recommend Cinda for 221!"
    }
]