[
    {
        "course": "MATH221",
        "timestamp": "Jul 2nd, 2024",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "Fantastic lecturer, always approachable in office hours, the man is a genius. Definitely learned a great deal of matrix algebra and walked away with a good understand of the concepts. Always encourages his students to look at the material more deeply. Final was a bit hard, but I would pick still Ben any day of the week for any course."
    },
    {
        "course": "MATH221",
        "timestamp": "Jun 28th, 2024",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "Dr. Williams is a top-favourite professor in my opinion. His teaching style encouraged real understanding of a problem and applying methods learned in lecture to find the solution. There was a lot of work needed to study/do homework but in the end it paid off, and I surprisingly found myself really enjoying this math course thanks to Dr. Williams."
    },
    {
        "course": "MATH221",
        "timestamp": "May 10th, 2024",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "His lectures are engaging and this class had tons of online resources available (mini-lecture videos covering specific topics, finals from different years, for example).  He's active on piazza and he's approachable during office hours and immediately after the lecture. Never made me feel dumb for having a question :) final was difficult tho lol"
    },
    {
        "course": "MATH221",
        "timestamp": "May 5th, 2024",
        "quality": "4.0",
        "difficulty": "4.0",
        "comments": "221 is one of the easiest 200 level math courses, so it's relatively easy to do well on the midterms. However, the final was what knocked our grades down. IT WAS HARD. Ben only scaled those who missed a midterm and those who did so bad on the midterms that they're depending on the final to survive, so it was kinda unfair to other students."
    },
    {
        "course": "MATH220",
        "timestamp": "Apr 23rd, 2024",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "As long as you review the class everyday, you will be ok. The professor is the best"
    },
    {
        "course": "MATH221",
        "timestamp": "Apr 23rd, 2024",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "His lecture is pretty interesting and easy to understand. Recommend"
    },
    {
        "course": "MATH221",
        "timestamp": "Apr 23rd, 2024",
        "quality": "5.0",
        "difficulty": "1.0",
        "comments": "take it, its easy and good"
    },
    {
        "course": "MATH221",
        "timestamp": "Apr 22nd, 2024",
        "quality": "2.0",
        "difficulty": "5.0",
        "comments": "Very very very bad exams. Midterms are still fine, final was a nightmare to students. Questions on the final were not covered in class, and not even in the practice exams. Very disappointing."
    },
    {
        "course": "MATH221",
        "timestamp": "Apr 20th, 2024",
        "quality": "5.0",
        "difficulty": "2.0",
        "comments": "I don't know why there is so much hate around Ben. I enjoyed every of his lectures. He tried to engage every student with funny jokes and answered any question during the lecture. Our mt averages were pretty high and the course is easy if you put at least 60% of ur effort into it"
    },
    {
        "course": "MATH220",
        "timestamp": "Mar 8th, 2024",
        "quality": "3.0",
        "difficulty": "3.0",
        "comments": "His teaching quality is good, he's active on piazza and generally quite approachable but there were types of questions in HW assignments and midterm which he did not even touch upon during lectures. So I believe he doesn't cover everything in the course content and for a course like MATH220, that is not ideal."
    },
    {
        "course": "MATH221",
        "timestamp": "Dec 20th, 2022",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "I did not like Ben when I took Math 105. I thought he was a bit arrogant, unreachable, and not very clear. However, his lectures for Math 221 were super clear, interactive, and based on conceptual understanding. He is super active on Piazza and answers questions asked out of curiosity. A dedicated student to maths will surely love his class."
    },
    {
        "course": "MATH221",
        "timestamp": "Dec 10th, 2022",
        "quality": "1.0",
        "difficulty": "4.0",
        "comments": "Horrible teaching style. Does not respond to questions in a clear and accessible manner, makes concepts even more difficult to understand. Also quite inconsiderate, arrogant and not understanding. Would never take a class with him again."
    },
    {
        "course": "MATH221",
        "timestamp": "Jul 6th, 2022",
        "quality": "1.0",
        "difficulty": "5.0",
        "comments": "This man single handedly ruined my chances of getting into my DREAM major. Class average was 62% while the next term had a class average of 78%. Midterm averages were 50% and 58%."
    },
    {
        "course": "MATH105",
        "timestamp": "May 5th, 2022",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Professor Williams is very knowledgeable and passionate about math. He explains the theoretical concepts clearly in an interesting way. When asked questions, he always gives quality answers in depth and answers respectfully. His lectures were interesting and although long, they were not too hard to follow. Overall, a great instructor for math."
    },
    {
        "course": "MATH220",
        "timestamp": "Jan 14th, 2022",
        "quality": "5.0",
        "difficulty": "3.0",
        "comments": "Ben is one of the best math profs I've ever had at UBC. I don't know why but I think he just has the gift for teaching math. His lectures were clear and easy to understand. He cares about students and is very active on piazza as well. Although his exams could be hard sometimes."
    },
    {
        "course": "MATH220",
        "timestamp": "Mar 21st, 2021",
        "quality": "1.0",
        "difficulty": "5.0",
        "comments": "Professor Williams like to talk about his \"theory\" in lectures which deviates from the textbook and course material. Homework is hard and the lecture and textbook is basically useless. I have to struggle on this course pretty badly given I'm good at math. Worst prof and teaching team ever!!"
    },
    {
        "course": "MATH220",
        "timestamp": "Mar 16th, 2021",
        "quality": "1.0",
        "difficulty": "5.0",
        "comments": "useless and unhelpful, also tough grader and awful teaching team."
    },
    {
        "course": "MATH221",
        "timestamp": "Dec 20th, 2020",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "Ben has a true gift for teaching math, and I feel lucky to have been taught by him. If I was better at math and wasnt more into CS, someone like him would probably inspire me to major in math. If you are a math major, you would probably get a lot out of a course with him. Hes tough, but he cares a lot and is a masterful teacher."
    },
    {
        "course": "MATH527",
        "timestamp": "Oct 14th, 2020",
        "quality": "5.0",
        "difficulty": "4.0",
        "comments": "Ben's the best prof for algebraic topology ! He's amazingly brilliant and inspirational! he's a funny guy i like his jokes in class. Algebraic topology is an intimidating subject, but he's being so helpful in office hour, and encourage me a lo t! Ben gives feedback to prove read our paper even our own prof has no time, ben's the nicest person!"
    },
    {
        "course": "MATH221",
        "timestamp": "Nov 20th, 2018",
        "quality": "3.0",
        "difficulty": "3.0",
        "comments": "I can't say he's particularly good or bad. He taught my lecture when Samuel Bach was away. He explains decently but sometimes goes beyond the relevant class material. If you go to office hours, be sure to know what is not relevant, as he frequently veers off."
    }
]